OpenFoam/Transient_laminar_duct/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    duct1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          10222;
        startFace       245676;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          378;
        startFace       255898;
    }
    inlet1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          380;
        startFace       256276;
    }
    duct2
    {
        type            wall;
        inGroups        1(wall);
        nFaces          304;
        startFace       256656;
    }
    inlet2
    {
        type            wall;
        inGroups        1(wall);
        nFaces          16;
        startFace       256960;
    }
    symmetry
    {
        type            symmetryPlane;
        inGroups        1(wall);
        nFaces          6572;
        startFace       256976;
    }
)

// ************************************************************************* //
